# IsValidShape Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeType..::..IsValidShape Method
DirectShapeType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidShape(ExternallyTaggedGeometryObject) | Validates shape to be stored in a DirectShapeType. |
| IsValidShape(IList<(Of <<'(GeometryObject>)>>)) | Validates shape to be stored in a DirectShapeType. |
| IsValidShape(IList<(Of <<'(GeometryObject>)>>), DirectShapeTargetViewType) | Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type. |

# See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace